In [1]:
import pandas as pd
import numpy as np

In [8]:
population = pd.read_csv('./data/income_data.csv')
population.head()

   ID  Age Region  Income  Spending           Town
0   1   80  Rural   41234       176  Forest Hollow
1   2   63  Urban   92689      4847    Stonebridge
2   3   80  Rural   42564       793   Cedar Valley
3   4   20  Rural   33606       464   Cedar Valley
4   5   46  Rural   22115        58   Cedar Valley

In [15]:
pop_mean = int(population['Income'].mean())

In [12]:
stratified = pd.read_csv('./data/income_stratified_sample.csv')
simple = pd.read_csv('./data/income_simple_random_sample.csv')
cluster = pd.read_csv('./data/income_cluster_sample.csv')
systematic = pd.read_csv('./data/income_systematic_sample.csv')

In [17]:
df_map = {
    'stratified': stratified,
    'simple': simple,
    'cluster': cluster,
    'systematic': systematic
}

rows = []

for key, df in df_map.items():
    cur_mean = int(df['Income'].mean())
    rows.append({'type': key, 'mean': cur_mean, 'differenceToPopulation': cur_mean - pop_mean})

sample_means = pd.DataFrame(rows)

sample_means

         type   mean  differenceToPopulation
0  stratified  56268                  -10521
1      simple  59934                   -6855
2     cluster  99235                   32446
3  systematic  63510                   -3279

In [18]:
cluster['Town'].value_counts()

Town
Sunset City    72
Grassville     66
Hilltop        64
Name: count, dtype: int64

In [24]:
population.groupby('Town')['Income'].agg(['count', 'mean']).sort_values(by='mean', ascending=False)

               count           mean
Town
Grassville        66  150476.454545
Brookfield        77   76650.064935
Brighton          74   76563.432432
Maple Heights     82   75915.487805
Silverlake        71   75896.239437
Sunset City       72   75196.638889
Stonebridge       65   74778.323077
Hilltop           64   73436.906250
Riverfall         60   72918.733333
Lakeside          59   71827.576271
Forest Hollow     63   33800.380952
Meadowtown        45   32779.088889
Pineville         74   32671.864865
Willowbrook       61   32144.278689
Cedar Valley      67   31434.656716

In [25]:
stratified['Spending'].mean(), population['Spending'].mean()

(np.float64(2255.68), np.float64(2912.968))